[
  {
    "question": "What is Celer Pay?",
    "category": "product",
    "ans": "Celer Pay is your off-chain wallet in CelerX app. You can use Celer Pay to send instant payment with ZERO transaction fee and play different highly interactive games in CelerX app. Tokens deposited in Celer Pay is not controlled by Celer and you have full control of your fund at all times."
  },
  {
    "question": "What is Blockchain Assets?",
    "category": "product",
    "ans": "Blockchain Assets represent your on-chain wallet which holds your digital assets and cryptocurrencies such as ETH, DAI, CELR token, etc."
  },
  {
    "question": "What is GT?",
    "category": "product",
    "ans": "Game Token (GT) is an ERC-20 token that we created for you to try and practice games in CelerX app. GT has no value and you can not purchase GT. You can get GT by completing various tasks in the app, such as daily check-in, back up wallet, etc."
  },
  {
    "question": "What is court mode?",
    "category": "product",
    "ans": "If you opponent left and force quit the app, then you are opt to go into “court mode“ after timeout. The “court mode” will trigger on-chain disputing process for the game. After the disputing process, which usually takes 5-10 mins, you will get the prize you deserve.<br/><br/>Since “court mode” is an on-chain disputing process, you will need ETH to pay for the transaction fees. Please remember to have enough ETH balance if you wish to go to “court mode”, otherwise, the game would be concluded as a draw and your entry fee would refund back to you in a few hours."
  },
  {
    "question": "I got stuck in the “court mode” for a long time. What happened? Can I abort the “court mode?",
    "category": "product",
    "ans": "The “court mode” will trigger on-chain disputing process for the game, which involves multiple on-chain transactions. The entire disputing process might take up to 10 minutes. Please wait patiently.<br><br>If you abort the “court mode”, the game will be concluded as a draw and your entry fee will be refunded back to youin a few hours."
  },
  {
    "question": "Is there any regional restrictions on real-money competitions?",
    "category": "product",
    "ans": "Yes. CelerX provides real-money competitions for in roughly 80% of the world and 38 US states - the exceptions being Arizona, Arkansas, Connecticut, Delaware, Florida, Louisiana, Maryland, Montana, South Carolina, South Dakota, and Tennessee. Our GT matches are available globally."
  },
  {
    "question": "What is Recovery Phrase?",
    "category": "product",
    "ans": "You may often see “recovery phrase”, “12-word phrase” when you create a new blockchain wallet. The 12-word recovery phrase is generated by your wallet. If for some reason, your computer or phone is lost or damaged, you can use your recovery phrase to access your blockchain wallet using another device.<br><br>Remember to write down your recovery phrase and store it in a safe place."
  }
]
