[
  {
    "question": "What is CelerX?",
    "category": "product",
    "ans": "CelerX is an end-user platform connected to Celer Network. Unlike using other blockchain wallets, by using CelerX, you could:<br><br>  1. Transfer fund almost instantly with 0 fees;<br>  2. Access highly interactive decentralized applications built on top of Celer, averting the slowness of underlying blockchain.<br><br>CelerX does not sacrifice decentralization, you still remain a fully control over your blockchain assets. To know more about CelerX’s backbone technology, visit celer.network."
  },
  {
    "question": "What is Celer Pay?",
    "category": "product",
    "ans": "Payment app on CelerX, where you can send 0-fee instant payment transactions. A quick metaphor: take Celer Pay as a premium FastPass in theme parks that helps you jump on top of the line in a crowded world of blockchain. Plus, tokens deposited in <span class=\" font-w-semibold\">Celer Pay is not controlled by Celer and you still have full control of your fund at all times.</span>"
  },
  {
    "question": "What is Reserve Fee?",
    "category": "product",
    "ans": "When using Celer Pay and applications, occasionally, interactions are required between Celer’s layer-2 scaling network and underlying layer-1 blockchain. Some examples are depositing to and withdrawing from Celer, disputing in decentralized applications. These interactions incurs blockchain transactions on and will cause transaction fees like any other on-chain transactions. In Ethereum’s case, it would be “gas fee” paid in ETH. To track this on-chain transaction fee reserve, we created the concept of Reserved Fee. It helps you to track and make sure you always have some on-chain balances for such interactions.",
    "ID": "reserve-fee"
  },
  {
    "question": "What are the Apps?",
    "category": "product",
    "ans": "In CelerX, we are continuously launching and more and more fun applications built on top of Celer SDK. Apps in CelerX require zero transaction fees and offer an10,000X faster interactive user experience comparing with slow dApps built directly on blockchain."
  },
  {
    "question": "Is there a centralized entity managing my tokens when using CelerX?",
    "category": "product",
    "ans": "No, you take full control of your fund. Depositing in Celer Pay only means that you use certain tokens to join Celer Network and can start to enjoy 0-fee instant payments and highly interactive applications."
  },
  {
    "question": "Why does it take so long to claim my free GT token for the first time?",
    "category": "product",
    "ans": "Claiming your free GT tokens for the first time involves an on-chain transaction which may take up to 10 minutes, depending on the congestion level of Ethereum (currently the Ropsten testnet). Please wait patiently. If you encounter any error during this process, please try restarting your app and claim free GT tokens again."
  },
  {
    "question": "I cannot correctly initialize my Celer client. What happened?",
    "category": "product",
    "ans": "There are multiple reasons that might lead to the failure. Most common ones include: <br><br>The connection to Ethereum is refused. We are currently using Infura to interact with Ethereum. However, the service provided by Infura is not guaranteed, and the connection to Infura could be refused for various reasons.<br>• If you are located in China, the connection to our off-chain service provider (hosted in Amazon AWS) may be flaky and get rejected due to geo-blocking."
  },
  {
    "question": "Why does it take so long to deposit/withdraw my tokens?",
    "category": "product",
    "ans": "Depositing or withdrawing tokens involves on-chain transactions which may take up to 10 minutes, depending on the congestion level of Ethereum (currently the Ropsten testnet). Please wait patiently. If you encounter any error during this process, please try restarting your app and deposit/withdraw again."
  },
  {
    "question": "Can I send payment to an offline peer?",
    "category": "product",
    "ans": "We require both the sender and the receiver to be online in order to successfully deliver the payment. If you are sending a payment to an offline peer, the payment will stay in the “Pending” status and refunded to your account after a certain timeout (usually after 6 blocks)."
  },
  {
    "question": "I cannot join the game room created by someone. What happened?",
    "category": "product",
    "ans": "This scenario usually happens when you are joining a room that has already been occupied by some other player. Please try other game rooms."
  },
  {
    "question": "Can I leave the Gomoku game while playing?",
    "category": "product",
    "ans": "• If you want to leave the game during play, you need to “surrender” first and your game stake will be rewarded to your opponent.<br>• If you force close the app, your opponent may request to enter the “court mode” which triggers the on-chain dispute mode, and your game stake will be rewarded to your opponent after the disputing process."
  },
  {
    "question": "What happened if my opponent left during the game? What is “court mode”?",
    "category": "product",
    "ans": "• If your opponent left and chose “surrender”, then the game ends and you will be rewarded with your opponent’s stake.<br>• If you opponent left and force quit the app, then you are opt to go into “court mode” after timeout. The “court mode” will trigger on-chain disputing process for the game. After the disputing process, which usually takes up to 15 mins, you will get the stake from your opponent."
  },
  {
    "question": "I got stuck in the “court mode” for along time. What happened? Can I abort the “court mode”?",
    "category": "product",
    "ans": "• The “court mode” will trigger on-chain disputing process for the game, which involves multiple on-chain transactions. The entire disputing process might take up to 15 minutes. Please wait patiently.<br>• If you abort the “court mode”, you will not receive the game stake from your opponent and your game stake will be locked for 2 hours (500 blocks)."
  },
  {
    "question": "How can I get Ropsten testnet ETH?",
    "category": "product",
    "ans": "The easiest way to get free Ropsten testnet ETH is via <a href=\"https://faucet.ropsten.be\">Rospten faucets</a>.",
    "ID": "testnet-eth"
  },
  {
    "question": "Can I recover my off-chain balance if I delete app data?",
    "category": "product",
    "ans": "No. Currently, you need to withdraw all your off-chain balance before deleting the app data; otherwise, it is NOT recoverable. We will support off-chain state backup and recovery service in the future release."
  }
]
